README.org
*** agenda-files
disse kan man legge automatisk inn i .emacs med kommandoen c-[ (og ta ut med c-]). men jeg ser behov for å kunne ha et samlet syn på dette på tvers av tre maskiner (to linux-maskiner og en windows-maskin).

#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/agenda-files.el"
  ;; (cond ((eq system-type 'windows-nt) 
  ;;        (setq mjo "~/:c/users/bjorwa/documents/GitHub/markedsanalyse/journaler/"
  ;;              not "~/:c/users/bjorwa/documents/GitHub/markedsanalyse/notater/"))
  ;;       ((eq system-type 'gnu/linux) 
  ;;        (setq mjo "~/GitHub/markedsanalyse/journaler/"
  ;;              not "~/GitHub/markedsanalyse/notater/")))
  ;; (setq org-agenda-files (concat mjo "energi-master.org"))
  ;; ;; (setq org-agenda-files (concat mjo "balanser.org"))
  ;;                         (concat mjo "presentasjoner.org")
  ;;                         (concat mjo "liq.org")
  ;;                        (concat mjo "bd.org")
  ;;                         (concat mjo "pk.org")
  ;;                         (concat mjo "journal.org")
  ;;                         (concat not "informatikk.org")
  ;;                         (concat not "ferdigheter.org"))

  ;; (setq org-agenda-files '("~/GitHub/markedsanalyse/journaler/energi-master.org"
  ;;                           "~/GitHub/markedsanalyse/journaler/balanse.org"
  ;;                           "~/GitHub/markedsanalyse/journaler/presentasjoner.org"
  ;;                           "~/GitHub/markedsanalyse/journaler/liq.org"
  ;;                           "~/GitHub/markedsanalyse/journaler/bd.org"
  ;;                           "~/GitHub/markedsanalyse/journaler/pk.org"
  ;;                           "~/GitHub/notater/samfunndrill.org"
  ;;                           "~/GitHub/markedsanalyse/journaler/journal.org" 
  ;;                           "~/GitHub/notater/moeter.org" 
  ;;                           "/home/bwarland/GitHub/notater/informatikk.org"
  ;;                           "~/GitHub/notater/ferdigheter.org"))
#+end_src
*** org-agenda
ingen endring mulig i agendabuffer, men man kan gå fra agendabuffer til filene som det henvises til, og det er mulig å endre disse filene fra agendabufferen.

dersom man ønkser å beholde vindusoppsettet slik man har det når man påkaller agendabufferen så må man sette følgende variabel: (setq org-agenda-window-setup 'current-buffer).

det er ryddig å se todo i sammenheng med "scheduled:" og "deadline:" ellers så risikerer man at hele todo-listen blir kleiset rett inn under "time-grid", dvs. når man bruker aktiv data. 
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/org-agenda.el"
  (setq org-agenda-columns t
        org-agenda-tags-column -100
        org-agenda-include-deadlines t
        org-agenda-compact-blocks t
        org-agenda-block-seperator t
        org-agenda-span 5
        org-agenda-window-setup 'other-window
        ;; agenda log
        org-agenda-start-with-log-mode t
        org-agenda-log-done 'note
        org-agenda-log-into-drawer t
              ;; time grid
        org-agenda-include-diary t
        org-agenda-skip-scheduled-if-done t
        org-agenda-skip-deadline-if-done t
        org-agenda-use-time-grid t
        org-agenda-sticky t
        org-agenda-time-grid (quote ((daily today remove-match)
                                     (0600 0800 1000 1200 1400 1600 1800)
                                     "      " "................")))
(add-hook 'after-init-hook 'org-agenda-list)
#+end_src
*** [[https://GitHub.com/alphapapa/org-super-agenda][org-super-agenda]] 
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/org-agenda.el"
  (require 'org-super-agenda)
  (use-package org-super-agenda
    :ensure t
    :config
    (org-super-agenda-mode 1)
    (setq org-super-agenda-groups
          '((:name "tidsplan     ========================================================================================"
                 :time-grid t)
	  
            (:name "sortering    ========================================================================================"
                 :todo "TODO")
            (:name "bearbeiding  ========================================================================================"
                 :todo "NEXT")
            (:name "dataoppdatering ====================================================================================="
                 :todo "DATA")
            (:name "presentasjoner ======================================================================================"
                   :todo "PRES")
            (:name "balanse      ========================================================================================"
                   :todo "BAL")
            (:name "marked       ========================================================================================"
                 :todo "TODO"
                 :tag ("coal" "hydrogen"))
            (:name "informatikk  ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++"
                 :tag ("informatikk" "emacs" "git" "linux" "scheme" "python"))
            (:name "samfunnsfag  ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++"
                   :tag ("samfunn" "økonomi"))
            )))

#+end_src
** filer mye brukt i omarkivering
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/org-konf.el"
    (let ((wp "~/:c/users/bjorwa/documents/GitHub/markedsanalyse/journaler/")
          (lp "~/GitHub/markedsanalyse/journaler/"))
      (cond ((eq system-type 'windows-nt)
             (setq org-refile-targets (quote (((concat wp "arkiv.org") :maxlevel . 2)
                                              ((concat wp "liq.org") :maxlevel . 4)
                                              ((concat wp "reg.org") :maxlevel . 4)
                                              ((concat wp "master-energi.org.org") :maxlevel . 4)))))
            ((eq system-type 'gnu/linux)
             (setq org-refile-targets (quote (((concat lp "arkiv.org") :maxlevel . 2)
                                              ((concat lp "liq.org") :maxlevel . 4)
                                              ((concat lp "reg.org") :maxlevel . 4)
                                              ((concat lp "master-energi.org.org") :maxlevel . 4)))))))
  (advice-add 'org-refile :after 'org-save-all-org-buffers)
#+end_src
** hydra
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/org-konf.el"
  (require 'org-fc-hydra)
#+end_src
** maler
