agenda-files.el
;; (cond ((eq system-type 'windows-nt) 
;;        (setq mjo "~/:c/users/bjorwa/documents/GitHub/markedsanalyse/journaler/"
;;              not "~/:c/users/bjorwa/documents/GitHub/markedsanalyse/notater/"))
;;       ((eq system-type 'gnu/linux) 
;;        (setq mjo "~/GitHub/markedsanalyse/journaler/"
;;              not "~/GitHub/markedsanalyse/notater/")))
;; (setq org-agenda-files (concat mjo "energi-master.org"))
;; ;; (setq org-agenda-files (concat mjo "balanser.org"))
;;                         (concat mjo "presentasjoner.org")
;;                         (concat mjo "liq.org")
;;                        (concat mjo "bd.org")
;;                         (concat mjo "pk.org")
;;                         (concat mjo "journal.org")
;;                         (concat not "informatikk.org")
;;                         (concat not "ferdigheter.org"))

;; (setq org-agenda-files '("~/GitHub/markedsanalyse/journaler/energi-master.org"
;;                           "~/GitHub/markedsanalyse/journaler/balanse.org"
;;                           "~/GitHub/markedsanalyse/journaler/presentasjoner.org"
;;                           "~/GitHub/markedsanalyse/journaler/liq.org"
;;                           "~/GitHub/markedsanalyse/journaler/bd.org"
;;                           "~/GitHub/markedsanalyse/journaler/pk.org"
;;                           "~/GitHub/notater/samfunndrill.org"
;;                           "~/GitHub/markedsanalyse/journaler/journal.org" 
;;                           "~/GitHub/notater/moeter.org" 
;;                           "/home/bwarland/GitHub/notater/informatikk.org"
;;                           "~/GitHub/notater/ferdigheter.org"))
