README.org
*** fangstmaler
jeg bruker mange av disse fangstmalene både i arbeid og privat da det er noe som hjelper meg å samle, fange og lagre informasjon raskt. dette viser også konfigureringen, skjønt det kan bli noe graps i koden. 
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/org-konf.el"
  (cond ((eq system-type 'windows-nt)
         (setq org-capture-templates
               (quote (
                       ("d" "drill/emner")
                       ("db" "powerbi" entry (file+olp "~/c:/users/bjorwa/documents/GitHub//GitHub/notater/informatikk.org" "powerbi")
                        "** %? :drill:power_bi:\n:properties:\n:drill_card_type: twosided\n:end:\n# ")
                       ("dd" "database" entry (file+olp "~/c:/users/bjorwa/documents/GitHub//GitHub/notater/informatikk.org" "database")
                        "** %? :drill:db:\n:properties:\n:drill_card_type: twosided\n:end:\n# ")
                       ("de" "emacs config" entry (file+olp "~/c:/users/bjorwa/documents/GitHub//GitHub/notater/informatikk.org" "emacs")
                        "** %? :drill:emacs:\n:properties:\n:drill_card_type: twosided\n:end:\n# ")
                       ("dg" "GitHub" entry (file+olp "~/c:/users/bjorwa/documents/GitHub/notater/informatikk.org" "git")
                        "** %? :drill:git:\n:properties:\n:drill_card_type: twosided\n:end:\n# ")
                       ("di" "informatikk" entry (file+olp "~/c:/users/bjorwa/documents/GitHub//GitHub/notater/informatikk.org" "informatikk")
                        "** %? :drill:informatikk:\n:properties:\n:drill_card_type: twosided\n:end:\n# ")
                       ("dl" "linux" entry (file+olp "~/c:/users/bjorwa/documents/GitHub//GitHub/notater/informatikk.org" "linux")
                        "** %? :drill:linux:\n:properties:\n:drill_card_type: twosided\n:end:\n# ")
                       ("dn" "numpy" entry (file+olp "~/c:/users/bjorwa/documents/GitHub//GitHub/notater/informatikk.org" "numpy")
                        "** %? :drill:python:\n:drill_card_type: twosided\n:end:\n# ")
                       ("do" "office" entry (file+olp "~/c:/users/bjorwa/documents/GitHub//GitHub/notater/informatikk.org" "office")
                        "** %? :drill:office:\n:properties:\n:drill_card_type: twosided\n:end:\n# ")
                       ("dp" "pandas" entry (file+olp "~/c:/users/bjorwa/documents/GitHub//GitHub/notater/informatikk.org" "pandas")
                        "** %? :drill:python:\n:properties:\n:drill_card_type: twosided\n:end:\n# ")
                       ("dp" "python" entry (file+olp "~/c:/users/bjorwa/documents/GitHub//GitHub/notater/informatikk.org" "python")
                        "** %? :drill:python:\n:properties:\n:drill_card_type: twosided\n:end:\n# ")
                       ("dr" "racket" entry (file+olp "~/c:/users/bjorwa/documents/GitHub//GitHub/notater/informatikk.org" "racket")
                        "** %? :drill:scheme:\n:properties:\n:drill_card_type: twosided\n:end:\n# ")
                       ("dx" "excel" entry (file+olp "~/c:/users/bjorwa/documents/GitHub//GitHub/notater/informatikk.org" "racket")
                        "** %? :drill:excel:\n:properties:\n:drill_card_type: twosided\n:end:\n# ")
                       ("f" "fortelling og retorikk")
                       ("ff" "fortelling" entry (file+olp "~c:/users/bjorwa/documents/GitHub/notater/forret.org" "fortelling")
                        "* %?\n")
                       ("fr" "retorikk" entry (file+olp "~c:/users/bjorwa/documents/GitHub/notater/forret.org" "retorikk")
                        "* %?\n")
                       ("h" "handling/gjøremål")
                       ("hg" "gjøremål" entry (file+olp "~/c:/users/bjorwa/documents/GitHub//GitHub/notater/moeter.org" "gjøremål")
                        "* todo %?\n%^t")
                       ("hm" "møter" entry (file+olp "~/c:/users/bjorwa/documents/GitHub//GitHub/notater/moeter.org" "møter")
                        "* %?\n%^t")
                       ("j" "journal/føring")
                       ("jd" "dagbok" entry (file+datetree+prompt "~/c:/users/bjorwa/documents/GitHub//GitHub/journal/dagbok.org")
                        "* %?\n")
                       ("jf" "fundamentals" entry (file+datetree+prompt "~/c:/users/bjorwa/documents/GitHub//GitHub/markedsanalyse/journaler/fundamentals.org")
                        "* %?\nhjlink")
                       ("jf" "ferdigheter" entry (file+datetree+prompt "~/c:/users/bjorwa/documents/GitHub//GitHub/notater/ferdigheter.org")
                        "* %?\n")
                       ("jj" "journal" entry (file+datetree+prompt "~/c:/users/bjorwa/documents/GitHub//GitHub/markedsanalyse/journaler/journal.org")
                        "* %?\nhjlink")
                       ("jr" "retorikk og kommunikasjon" entry (file+datetree+prompt "~/c:/users/bjorwa/documents/GitHub/journal/retorikk.org")
                        "* %?\n")
                       ("jø" "økonomi" entry (file+datetree+prompt "~/c:/users/bjorwa/documents/GitHub//GitHub/notater/econ.org")
                                       ("t" "tabell")
                       ("th" "handel" table-line (file+headline "~/notebook/markedsvurdering.org" "dagsrapport" "handel")
                        "|%^u|%^{type}|%^{selger}|%^{kjøper}|%^{periode}|%^{incoterm}|%^{pris}|%^{kilde}|%^{kommentar}|")
                        "* %?\n"))))
         )
        ((eq system-type 'gnu/linux)
         (setq org-capture-templates
               (quote (
                       ("d" "drill")
                       ("db" "powerbi" entry (file+olp "~/GitHub/notater/informatikk.org" "powerbi")
                        "** %? :drill:power_bi:\n:properties:\n:drill_card_type: twosided\n:end:\n# ")
                       ("dd" "database" entry (file+olp "~/GitHub/notater/informatikk.org" "database")
                        "** %? :drill:db:\n:properties:\n:drill_card_type: twosided\n:end:\n# ")
                       ("de" "emacs config" entry (file+olp "~/GitHub/notater/informatikk.org" "emacs")
                        "** %? :drill:emacs:\n:properties:\n:drill_card_type: twosided\n:end:\n# ")
                       ("dg" "GitHub" entry (file+olp "~/GitHub/notater/informatikk.org" "git")
                        "** %? :drill:git:\n:properties:\n:drill_card_type: twosided\n:end:\n# ")
                       ("di" "informatikk" entry (file+olp "~/GitHub/notater/informatikk.org" "informatikk")
                        "** %? :drill:informatikk:\n:properties:\n:drill_card_type: twosided\n:end:\n# ")
                       ("dl" "linux" entry (file+olp "~/GitHub/notater/informatikk.org" "linux")
                        "** %? :drill:linux:\n:properties:\n:drill_card_type: twosided\n:end:\n# ")
                       ("dn" "numpy" entry (file+olp "~/GitHub/notater/informatikk.org" "numpy")
                        "** %? :drill:python:\n:drill_card_type: twosided\n:end:\n# ")
                       ("do" "office" entry (file+olp "~/GitHub/notater/informatikk.org" "office")
                        "** %? :drill:office:\n:properties:\n:drill_card_type: twosided\n:end:\n# ")
                       ("dp" "pandas" entry (file+olp "~/GitHub/notater/informatikk.org" "pandas")
                        "** %? :drill:python:\n:properties:\n:drill_card_type: twosided\n:end:\n# ")
                       ("dp" "python" entry (file+olp "~/GitHub/notater/informatikk.org" "python")
                        "** %? :drill:python:\n:properties:\n:drill_card_type: twosided\n:end:\n# ")
                       ("dr" "racket" entry (file+olp "~/GitHub/notater/informatikk.org" "racket")
                        "** %? :drill:scheme:\n:properties:\n:drill_card_type: twosided\n:end:\n# ")
                       ("ds" "samfunn" entry (file+olp "~/GitHub/notater/samfunndrill.org" "begreper")
                        "** %? :drill:samfunn:\n:properties:\n:drill_card_type: twosided\n:end:\n# ")
                       ("dx" "excel" entry (file+olp "~/GitHub/notater/informatikk.org" "racket")
                        "** %? :drill:excel:\n:properties:\n:drill_card_type: twosided\n:end:\n# ")
                       ("f" "fortelling")
                       ("ff" "fortelling" entry (file+olp "~/GitHub/notater/forret.org" "fortelling")
                        "* %?\n")
                       ("fr" "retorikk" entry (file+olp "~/GitHub/notater/forret.org" "retorikk")
                        "* %?\n")
                       ("h" "handling")
                       ("hg" "gjøremål" entry (file+olp "~/GitHub/notater/moeter.org" "gjøremål")
                        "* todo %?\n%^t")
                       ("hm" "møter" entry (file+olp "~/GitHub/notater/moeter.org" "møter")
                        "* %?\n%^t")
                       ("j" "journal")
                       ("jd" "dagbok" entry (file+datetree+prompt "~/GitHub/journal/dagbok.org")
                        "* %?\n")
                       ("jf" "fundamentals" entry (file+datetree+prompt "~/GitHub/markedsanalyse/journaler/fundamentals.org")
                        "* %?\nhjlink")
                       ("jf" "ferdigheter" entry (file+datetree+prompt "~/GitHub/notater/ferdigheter.org")
                        "* %?\n")
                       ("jj" "journal" entry (file+datetree+prompt "~/GitHub/markedsanalyse/journaler/journal.org")
                        "* %?\nhjlink")
                       ("jr" "retorikk" entry (file+datetree+prompt "~/GitHub/journal/retorikk.org")
                        "* %?\n")
                       ("js" "samfunn" entry (file+datetree+prompt "~/GitHub/journal/samfunn.org")
                        "* %?\n")
                       ("jt" "trening" entry (file+datetree+prompt "~/GitHub/journal/trening.org")
                        "* %?\n")
                       ("jø" "økonomi" entry (file+datetree+prompt "~/GitHub/journal/econ.org") 
                        "* %?\n")
                       ("t" "tabell")
                       ("ta" "price quote agencies" table-line (file+olp "~/GitHub/markedsanalyse/journaler/daily-market-update.org" "lng") 
                        "|%^u|%^{platts}|%^{argus}|%^{icis}|" :prepend t)
                       ("tt" "trening" table-line (file+headline "~/GitHub/journal/trening.org" "tabell")
                        "|%^u|%^{type}|%^{oppvarming}|%^{runder}|%^{vekt}|%^{tid}|%^{kommentar}|")
                       )))))
#+end_src

*** strukturmal
f.eks <pyt + tab vil eksandere til python med tangle.
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/org-konf.el"
  (require 'org-tempo)
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("elt" . "src emacs-lisp :tangle"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("pyt" . "src python :tangle"))
  (add-to-list 'org-structure-template-alist '("sr" . "src racket"))
  (add-to-list 'org-structure-template-alist '("srt" . "src racket :tangle"))
#+end_src
** org-babel"
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/org-konf.el"
  (org-babel-do-load-languages
   'org-babel-load-languages (quote ((emacs-lisp . t)
                                     (racket . t)
                                     (sqlite . t)
                                     (python . t))))
#+end_src

** terping
en strukturert terping av viktig informasjon, metoder og teknikker er viktig for meg da jeg har en teflonhjerne som ikke raskt absorberer. dette tror jeg er en pakke som ikke jevnlig oppdateres, om i det hele tatt. og her har jeg hatt litt problemer med en feilmelding og kluss med kode som jeg på et vil klarte å kontrollere ved å blokke ut noe av koden i modulens el-fil (laster denne inn i stedet for elc-filen, [[file:notater/ferdigheter.org::*feil under emacs-konfigurering][beskrivelse i filen ferdigheter.org]]).
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/org-konf.el"
  (require 'org-drill)

  (use-package org-drill
    :ensure t
    ;; https://gitlab.com/phillord/org-drill/
    :config
    (setq org-drill-maximum-duration 20
          org-drill-spaced-repetition-algorithm 'sm2
          org-drill-add-random-noise-to-intervals-p t
          org-drill-adjust-intervals-for-early-and-late-repetitions-p t))
#+end_src
** TODO-nøkkelord
når man setter variabelen "org-use-fast-todo-selection" til "t" så vil man få en meny med todo-nøkkelord man kan velge i fra. 
#+begin_src emacs-lisp :tangle orgtodo.el
  (setq org-todo-fast-todo-selection t
        org-todo-keywords '((sequence "TODO(t)" "NEXT(n)" "DATA(D)" "PRES(p)" "BAL(b)" "|" "DONE(d)"))
        org-todo-keyword-faces (quote (("TODO" :foreground "red" :background "white")
                                       ("NEXT" :foreground "blue" :background "white")
                                       ("DATA" :foreground "light slate grey" :background "white")
                                       ("PRES" :foreground "dark turquoise" :background "white")
                                       ("BAL" :foreground "dark olive green" :background "white")
                                       ("DONE" :foreground "dark green" :background "white"))))
#+end_src
* maler
** yasnippet
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/maler.el"
  (use-package yasnippet
    :ensure t
    :diminish yas-minor-mode
    :init (yas-global-mode)
    :config
    (yas-global-mode)
    (add-hook 'hippie-expand-try-functions-list 'yas-hippie-try-expand)
    (setq yas-key-syntaxes '("w_" "w_." "^ "))
  ;;    (setq yas-installed-snippets-dir "~/elisp/yasnippet-snippets")
    (setq yas-expand-only-for-last-commands nil)
    (yas-global-mode 1)
    (bind-key "\t" 'hippie-expand yas-minor-mode-map)
    (add-to-list 'yas-prompt-functions 'shk-yas/helm-prompt)
    (global-set-key (kbd "C-c y") (lambda () (interactive)
                                    (yas/load-directory "~/elisp/snippets"))))
#+end_src

* register
