README.org
** linux
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/linreg.el"
  (set-register ?d '(file . "~/GitHub/journal/dagbok.org"))
  (set-register ?t '(file . "~/GitHub/journal/trening.org"))
  (set-register ?c '(file . "~/GitHub/emacs-config/custom.el"))
  (set-register ?g '(file . "~/GitHub/"))
  (set-register ?f '(file . "~/GitHub/notater/ferdigheter.org"))
  (set-register ?k '(file . "~/GitHub/emacs-config/readme.org"))
  (set-register ?i '(file . "~/GitHub/notater/informatikk.org"))
  (set-register ?j '(file . "~/GitHub/markedsanalyse/journaler/journal.org")))
  (set-register ?l '(file . "~/GitHub/markedsanalyse/journaler/liq.org")))
  (set-register ?r '(file . "~/GitHub/markedsanalyse/journaler/reg.org")))
  (set-register ?e '(file . "~/.emacs")))
#+end_src
** windows
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/winreg.el"
  (set-register ?c '(file . "~/.emacs.d/custom.el"))
  ;; (set-register ?c '(file . "~/notebook/col.org"))
  ;; (set-register ?d '(file . "~/.emacs.d/snippets/org-mode/dayrep"))
  ;; (set-register ?e '(file . "~/.emacs"))
  (set-register ?j '(file . "c:\\users\\bjorwa\\documents\\GitHub\\markedsanalyse\\journaler\\journal.org"))
  (set-register ?f '(file . "c:\\users\\bjorwa\\documents\\GitHub\\markedsanalyse\\journaler\\fundamentals.org"))
  (set-register ?l '(file . "c:\\users\\bjorwa\\documents\\GitHub\\markedsanalyse\\journaler\\liq.org"))
  (set-register ?l '(file . "c:\\users\\bjorwa\\documents\\GitHub\\markedsanalyse\\journaler\\reg.org"))
  (set-register ?v '(file . "c:\\users\\bjorwa\\documents\\GitHub\\markedsanalyse\\journaler\\vedlikehold.org"))

  (set-register ?o '(file . "c:/users/bjorwa/appdata/roaming/notebook/oversikt.org"))
  (set-register ?m '(file . "c:/users/bjorwa/appdata/roaming/notebook/markedsvurdering.org"))
  (set-register ?p '(file . "c:/users/bjorwa/appdata/roaming/notebook/prices.org"))

  (set-register ?d '(file . "c:\\users\\bjorwa\\desktop\\"))
  (set-register ?g '(file . "c:\\users\\bjorwa\\documents\\GitHub\\"))

  ;; (set-register ?p '(file . "~/notebook/python.org"))
  ;; (set-register ?r '(file . "~/notebook/rapporter.org"))
  ;; (set-register ?r '(file . "~/.emacs.d/reg.el"))

    ;; (set-register ?c '(file . "~c:\\users\\bjorwa\\documents\\GitHub\\emacs-config\\custom.el"))
    ;;   (set-register ?g '(file . "~c:\\users\\bjorwa\\documents\\GitHub\\"))
    ;;   (set-register ?c '(file . "~c:\\users\\bjorwa\\documents\\GitHub\\notater\\ferdigheter.org"))
    ;;   (set-register ?k '(file . "~c:\\users\\bjorwa\\documents\\GitHub\\emacs-config\\readme.org"))
    ;;   (set-register ?i '(file . "~c:\\users\\bjorwa\\documents\\GitHub\\notater\\informatikk.org"))
    ;;   (set-register ?j '(file . "~c:\\users\\bjorwa\\documents\\GitHub\\markedsanalyse\\journaler\\informatikk.org"))
    ;;   (set-register ?l '(file . "~c:\\users\\bjorwa\\documents\\GitHub\\markedsanalyse\\journaler\\liq.org"))
    ;;   (set-register ?r '(file . "~c:\\users\\bjorwa\\documents\\GitHub\\markedsanalyse\\journaler\\reg.org"))
    ;;   (set-register ?e '(file . "~c:\\users\\bjorwa\\appdata\\roaming\\.emacs"))
#+end_src
* kommandoer og tastebinding
samling av kommandoer og tastebindinger som ikke nødvendigvis knyttes mot en emacs-pakke.
#+begin_src emacs-lisp :tangle "~/GitHub/emacs-config/gkb.el"
(global-set-key (kbd "\C-x\C-k") 'kill-region)
(global-set-key (kbd "\C-c\C-k") 'kill-region)

(global-set-key (kbd "C-<up>") 'text-scale-increase)
(global-set-key (kbd "C-<down>") 'text-scale-decrease)
(global-set-key (kbd "C-<wheel-up>") 'text-scale-increase)
(global-set-key (kbd "C-<wheel-down>") 'text-scale-decrease)

(global-set-key (kbd "C-c r") 'comment-region)
(global-set-key (kbd "C-c u") 'uncomment-region)

(global-set-key (kbd "C-x a") 'define-global-abbrev)

(global-set-key (kbd "C-c l") 'org-store-link)

(global-set-key (kbd "C-x C-<up>") 'windmove-up)
(global-set-key (kbd "C-x C-<down>") 'windmove-down)
(global-set-key (kbd "C-x C-<left>") 'windmove-left)
(global-set-key (kbd "C-x C-<right>") 'windmove-right)

(global-set-key (kbd "\M-?") 'help-command)
(global-set-key (kbd "<f1>") 'enlarge-window)
(global-set-key (kbd "<f2>") 'shrink-window)
(global-set-key (kbd "<f3>") 'shrink-window-horizontally)
(global-set-key (kbd "<f4>") 'enlarge-window-horizontally)
;; (global-set-key (kbd "<f5>") 'org-copy-subtree) ;; i custom.el
(global-set-key (kbd "<f9>") 'calc)
(global-set-key (kbd "<f11>") 'describe-function)
(global-set-key (kbd "<f12>") '(lambda ()
				 (interactive)
				 (popup-menu 'yank-menu)))
#+end_src

