linreg.el
(set-register ?d '(file . "~/GitHub/journal/dagbok.org"))
(set-register ?t '(file . "~/GitHub/journal/trening.org"))
(set-register ?c '(file . "~/GitHub/emacs-config/custom.el"))
(set-register ?g '(file . "~/GitHub/"))
(set-register ?f '(file . "~/GitHub/notater/ferdigheter.org"))
(set-register ?k '(file . "~/GitHub/emacs-config/readme.org"))
(set-register ?i '(file . "~/GitHub/notater/informatikk.org"))
(set-register ?j '(file . "~/GitHub/markedsanalyse/journaler/journal.org")))
(set-register ?l '(file . "~/GitHub/markedsanalyse/journaler/liq.org")))
(set-register ?r '(file . "~/GitHub/markedsanalyse/journaler/reg.org")))
(set-register ?e '(file . "~/.emacs")))
